1s/ERP/extensions/liko/Documents/Лико_ЗаказНаРаскрой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ЗаказНаРаскрой</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураВыпуск</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТочныйМетражРезки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодрезкаКромка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсправлениеРоликов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НормативРезки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РаскройСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяВыполненияПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаказовБЭ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяВыполненияПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатусДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаРаскрояМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалНаМашине</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резерв</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Раскрой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоРоликов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДлинаРолика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СнятьРезерв</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДанныеПоРаскрою</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Печатник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>МетражПоЗаказу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПечати</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/ПланированиеСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//
// Процедура СформироватьОперацию
//
/// Описание: НужноИзменить
//
// Параметры: 
// ИмяСвойства 		   - Строка          	    - (обязательный).  Пример: "Код"    НужноИзменить 
// РабочееМесто 	   - Строка 				- (необязательный).Пример: ПараметрыСеанса.РабочееМестоКлиента  НужноИзменить 
//
Процедура СформироватьОперацию(Заказ,РабочийЦентр,Статус,Приоритет=9999,ДатаОперации=Неопределено,Сортировка=Ложь)Экспорт  //+Лико m.shenderov 16.12.2021
 УстановитьПривилегированныйРежим(Истина);
	
	Если ДатаОперации=Неопределено Тогда		
		ДатаОперации=ТекущаяДата(); 
	КонецЕсли;
	
	ЗаписатьВПлан(Заказ,РабочийЦентр,Статус,Приоритет,Сортировка);
	
	Если Не Сортировка Тогда // <-- Начало Лико Яцун С. В. 07.03.2023 добавил параметр Сортировка=Ложь, при сортировке по первому прокату ранжировка вызывается после выполнения цикла
		РанжироватьЗаказыПоПриоритету(,ДатаОперации);
	КонецЕсли; // <-- Конец Лико Яцун С. В. 07.03.2023
	
КонецПроцедуры //СформироватьОперацию -Лико m.shenderov 16.12.2021
////////////////////////////////////////////////////////////////////////////////
//
// Процедура ЗаписатьВПлан
//
/// Описание: НужноИзменить
//
// Параметры: 
// ИмяСвойства 		   - Строка          	    - (обязательный).  Пример: "Код"    НужноИзменить 
// РабочееМесто 	   - Строка 				- (необязательный).Пример: ПараметрыСеанса.РабочееМестоКлиента  НужноИзменить 
//
Процедура ЗаписатьВПлан(Заказ,РабочийЦентр,Статус,Приоритет,Сортировка=Ложь) //+Лико m.shenderov 16.12.2021
 УстановитьПривилегированныйРежим(Истина);
	
	Массив		   = Новый Массив;
	Массив.Добавить(Перечисления.Лико_СтатусыЗаказовБЭ.ВПлане);
	Массив.Добавить(Перечисления.Лико_СтатусыЗаказовБЭ.ВРаботе);
	
	
	НаборЗаписей  = РегистрыСведений.Лико_ПланРаботБЭ.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Заказ.Установить(Заказ);	
	Если Массив.Найти(Статус)<>Неопределено Тогда
		
		Запись           		= НаборЗаписей.Добавить();
		Запись.Заказ    		= Заказ;
		Запись.РабочийЦентр 	= РабочийЦентр;
		Запись.Приоритет 		= Приоритет;
		Запись.Количество		=Заказ.КоличествоУпаковок;
		// <-- Начало Лико Яцун С. В. 24.03.2023 
		Если Сортировка И Заказ.Статус = Перечисления.Лико_СтатусыЗаказовБЭ.ВРаботе Тогда
			ТекЗапись = РегистрыСведений.Лико_ПланРаботБЭ.Получить(Новый Структура("Заказ",Заказ));
			Запись.ДатаНачала	= ТекЗапись.ДатаНачала;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 24.03.2023
	КонецЕсли;
	
	
	Если  Заказ.Статус<>Статус Тогда
		НачатьТранзакцию();
		ДокОбъект=Заказ.ПолучитьОбъект();
		ДокОбъект.Статус=Статус;
		ДокОбъект.СтатусДата=ТекущаяДата();
		ДокОбъект.ОбменДанными.Загрузка=Истина;
		ДокОбъект.Записать(); 
		НаборЗаписей.Записать();  
		ЗафиксироватьТранзакцию();
		
	Иначе 
		НаборЗаписей.Записать();		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //ЗаписатьВПлан -Лико m.shenderov 16.12.2021

Функция ЕстьЗаказыВПлане(МассивЗаказов) Экспорт  //+Лико m.shenderov 02.02.2022
     УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланЗаказов.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.Лико_ПланРаботБЭ КАК ПланЗаказов
	|ГДЕ
	|	ПланЗаказов.Заказ В(&МассивЗаказов)";
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Возврат Не Запрос.Выполнить().Пустой();
	
	
КонецФункции //-Лико m.shenderov 02.02.2022 

////////////////////////////////////////////////////////////////////////////////
//
// Процедура РанжироватьЗадачиПоПриоритету
//
/// Описание: НужноИзменить
//
// Параметры: 
// ИмяСвойства 		   - Строка          	    - (обязательный).  Пример: "Код"    НужноИзменить 
// РабочееМесто 	   - Строка 				- (необязательный).Пример: ПараметрыСеанса.РабочееМестоКлиента  НужноИзменить 
//
Процедура РанжироватьЗаказыПоПриоритету(МассивРЦ=Неопределено,ДатаОперации=Неопределено) Экспорт  //+Лико m.shenderov 16.12.2021
    УстановитьПривилегированныйРежим(Истина);
	Если  ДатаОперации=Неопределено Тогда 
		ДатаОперации=ТекущаяДата();
	КонецЕсли; 
	
	//СооПК= СооПроизводственныйКалендарь(НачалоДня(ДатаОперации));
	// <--  Лико Яцун С. В. 09.03.2023 добавил в запрос связь с ПооперационноеРасписание2_2, чтобы получить НачалоПервогоПроката для расчета ДатыНачала резки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПланРаботБЭ.Заказ КАК Заказ,
	|	Лико_ПланРаботБЭ.Заказ.Статус КАК Статус,
	|	Лико_ПланРаботБЭ.Заказ.ВремяВыполненияПлан КАК Осталось,
	|	Лико_ПланРаботБЭ.Заказ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Лико_ПланРаботБЭ.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ПланРаботБЭ.Приоритет КАК Приоритет,
	|	Лико_ПланРаботБЭ.ВРаботе КАК ВРаботе,
	|	Лико_ПланРаботБЭ.ДатаНачала КАК ДатаНачала,
	|	Лико_ПланРаботБЭ.ДатаОкончания КАК ДатаОкончания,
	|	Лико_ПланРаботБЭ.Трудозатраты КАК Трудозатраты,
	|	ЕСТЬNULL(Лико_РаскройМатериаловПланФактОстатки.КоличествоОстаток, 0) КАК КоличествоОсталось,
	|	Лико_ПланРаботБЭ.КоличествоОсталось КАК КоличествоОсталосьСтарое,
	|	ПооперационноеРасписание2_2.Начало КАК НачалоПервогоПроката,
	|	ПооперационноеРасписание2_2.Окончание КАК ОкончаниеПервогоПроката
	|ИЗ
	|	РегистрСведений.Лико_ПланРаботБЭ КАК Лико_ПланРаботБЭ
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_РаскройМатериаловПланФакт.Остатки(
	|				,
	|				Заказ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПланРаботБЭ.Заказ КАК Заказ
	|					ИЗ
	|						РегистрСведений.Лико_ПланРаботБЭ КАК Лико_ПланРаботБЭ)) КАК Лико_РаскройМатериаловПланФактОстатки
	|		ПО Лико_ПланРаботБЭ.Заказ = Лико_РаскройМатериаловПланФактОстатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2   
	|		ПО Лико_ПланРаботБЭ.Заказ.ЗаказКлиента = ПооперационноеРасписание2_2.Этап.Лико_ЗаказКлиента
	|			И (НЕ ПооперационноеРасписание2_2.Моделирование)
	|			И (ПооперационноеРасписание2_2.Этап.НомерПроката = 1)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФильтрПоРЦ
	|				ТОГДА Лико_ПланРаботБЭ.РабочийЦентр В (&МассивРЦ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//|	И Лико_ПланРаботБЭ.Заказ.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЦентр,
	|	Приоритет
	|ИТОГИ ПО
	|	РабочийЦентр";
	
	
	
	
	Запрос.УстановитьПараметр("ФильтрПоРЦ",МассивРЦ<>Неопределено);
	
	Запрос.УстановитьПараметр("МассивРЦ",МассивРЦ); 
	Запрос.УстановитьПараметр("ТекущаяДата",НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРЦ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//УстановитьПривилегированныйРежим(Истина);
	Пока ВыборкаРЦ.Следующий()  Цикл
		Сч=1;
		Выборка= ВыборкаРЦ.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ТекТрудозатраты=0;
			Если Сч=1 Тогда  	
				
				ДатаНачала=Выборка.ДатаНачала;
				
				Если Не ЗначениеЗаполнено(ДатаНачала) Или Выборка.Приоритет<>1 Тогда
					
					ДатаНачала = ДатаОперации;
					
				КонецЕсли;
				
				// <-- Начало Лико Яцун С. В. 06.03.2023 начало резки не может быть раньше начала первго проката печати заказа клиента
				Если ЗначениеЗаполнено(Выборка.НачалоПервогоПроката) И ДатаНачала < Выборка.НачалоПервогоПроката Тогда
					ДатаНачала = Выборка.НачалоПервогоПроката;	
				КонецЕсли;
				// <-- Конец Лико Яцун С. В. 06.03.2023
				
				Трудозатраты=(ДатаОперации-ДатаНачала)/(60*60);
				
			Иначе				
				Трудозатраты=0;				
			КонецЕсли;
			Если Выборка.КоличествоОсталось=Выборка.КоличествоОсталосьСтарое Тогда
				
				Осталось=Выборка.Осталось;
			Иначе
				Осталось= Документы.Лико_ЗаказНаРаскрой.РасчитатьВремяВыполнения(Выборка.Заказ,Выборка.КоличествоОсталось).ВремяВыполненияПлан;
			КонецЕсли;
			Осталось=?(Осталось<=0,1,Осталось);
			Осталось=Осталось-Трудозатраты;
			Осталось=?(Осталось<=0,1,Осталось);			
			НаборЗаписей           = РегистрыСведений.Лико_ПланРаботБЭ.СоздатьНаборЗаписей();					
			НаборЗаписей.Отбор.Заказ.Установить(Выборка.Заказ); 
			
			// <-- Начало Лико Яцун С. В. 06.03.2023 начало резки не может быть раньше начала первго проката печати заказа клиента	
			Если Сч = 1 Тогда
				ДатаНачалаСледующегоЗаказа = Неопределено;	
			КонецЕсли;
			Если (НЕ ЗначениеЗаполнено(Выборка.НачалоПервогоПроката) 
				ИЛИ (ЗначениеЗаполнено(Выборка.НачалоПервогоПроката) И ЗначениеЗаполнено(ДатаНачалаСледующегоЗаказа) И ДатаНачалаСледующегоЗаказа >= Выборка.НачалоПервогоПроката)) 
				И Сч > 1 Тогда
				ДатаНачала				= ДатаНачалаСледующегоЗаказа; //ДатаНачала = ДатаОкончания предыдущего заказа
			ИначеЕсли ЗначениеЗаполнено(Выборка.НачалоПервогоПроката) 
				И ЗначениеЗаполнено(ДатаНачалаСледующегоЗаказа) 
				И ДатаНачалаСледующегоЗаказа < Выборка.НачалоПервогоПроката 
				И Сч > 1 Тогда
				ДатаНачала				= Выборка.НачалоПервогоПроката; //ДатаНачала = НачалоПервогоПроката печати заказа клиента
			ИначеЕсли Сч > 1 Тогда 
				ДатаНачала				= ДатаНачалаСледующегоЗаказа; //ДатаНачала = ДатаОкончания предыдущего заказа
			КонецЕсли;
			// <-- Конец Лико Яцун С. В. 06.03.2023 
			
			Запись           		= НаборЗаписей.Добавить();
			Запись.Заказ    		= Выборка.Заказ;
			Запись.Осталось  		= Осталось;
			Запись.Трудозатраты		= Трудозатраты;
			Запись.ДатаНачала		= ДатаНачала;
			Запись.Количество		= Выборка.Заказ.КоличествоУпаковок;
			Запись.КоличествоОсталось= Выборка.КоличествоОсталось;
			
			//Запись.ДатаОкончания	= РассчитатьДатуОкончания(?(Сч=1,ДатаОперации,ДатаНачала),Выборка.Сотрудник,Осталось);  
			Запись.ДатаОкончания	= Макс(ДатаОперации,ДатаНачала+Осталось*60*60);
			
			//// <-- Начало Лико Яцун С. В. 06.03.2023 предполагаемая дата начала следующего заказа	
			//ДатаНачала				= Запись.ДатаОкончания;
			ДатаНачалаСледующегоЗаказа = Запись.ДатаОкончания;
			//// <-- Конец Лико Яцун С. В. 06.03.2023 
			
			Запись.РабочийЦентр =Выборка.РабочийЦентр;
			Запись.Приоритет =Сч;
			
			Если  Сч=1 И Запись.ДатаНачала<=ДатаОперации Тогда
				Запись.ВРаботе = Истина;
				лСтатус         = Перечисления.Лико_СтатусыЗаказовБЭ.ВРаботе;
			Иначе
				Запись.ВРаботе = Ложь;
				лСтатус         = Перечисления.Лико_СтатусыЗаказовБЭ.ВПлане;
			КонецЕсли;
			Если Выборка.Статус<>лСтатус Тогда
				ДокОбъект=Выборка.Заказ.ПолучитьОбъект();
				ДокОбъект.Статус=лСтатус; 
				ДокОбъект.СтатусДата=ДатаОперации;
				НачатьТранзакцию();
				ДокОбъект.ОбменДанными.Загрузка=Истина;
				ДокОбъект.Записать(); 
				НаборЗаписей.Записать();
				ЗафиксироватьТранзакцию();
			Иначе
				НаборЗаписей.Записать();
				
				
			КонецЕсли;
			
			
			Если Запись.ВРаботе<>Выборка.ВРаботе Тогда
				
				//ЗаписатьВЖурналОпераций(Запись.Задача,Запись.Сотрудник,Статус,ДатаОперации);
				
			КонецЕсли;
			
			Сч=Сч+1;
		КонецЦикла; 
	КонецЦикла;
	
	
	
	
КонецПроцедуры //РанжироватьЗадачиПоПриоритету -Лико m.shenderov 16.12.2021

Функция СформироватьМассивТЗСервер(Настройка=Неопределено,РабочийЦентр=Неопределено) Экспорт  //+Лико m.shenderov 27.12.2021  
	УстановитьПривилегированныйРежим(Истина);
	
	Если  Не ЗначениеЗаполнено(Настройка) Тогда
		Настройка=Справочники.Лико_НастройкиОтображенияПланаБЭ.Основная;
	КонецЕсли;
	
	
	МассивНастроек=Справочники.Лико_НастройкиОтображенияПланаБЭ.ПолучитьМассивНастроек(Настройка);
	
	Массив = Новый Массив;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеЦентры.РабочийЦентр КАК РабочийЦентр,
	|	РабочиеЦентры.НомерСтроки КАК НомерПП,
	|	Лико_РаботаНаРезакахСрезПоследних.Сотрудник КАК Сотрудник,
	|	Лико_РаботаНаРезакахСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ ВтРабочиеЦентры
	|ИЗ
	|	Справочник.Лико_НастройкиОтображенияПланаБЭ.РабочиеЦентры КАК РабочиеЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_РаботаНаРезаках.СрезПоследних КАК Лико_РаботаНаРезакахСрезПоследних
	|		ПО РабочиеЦентры.РабочийЦентр = Лико_РаботаНаРезакахСрезПоследних.РабочийЦентр
	|ГДЕ
	|	РабочиеЦентры.Ссылка = &Настройка
	|	И ВЫБОР
	|			КОГДА &ФильтрПоРЦ
	|				ТОГДА РабочиеЦентры.РабочийЦентр = &РабочийЦентр
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланРабот.Заказ КАК Заказ,
	|	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	|	ПланРабот.Приоритет КАК Приоритет,
	|	ПланРабот.Заказ.Номер КАК Номер,
	|	РабочиеЦентры.ПорядковыйНомер КАК Код,
	|	ПланРабот.Осталось КАК Осталось,
	|	ПланРабот.ДатаНачала КАК ДатаНачала,
	|	ПланРабот.ДатаОкончания КАК ДатаОкончания,
	|	ПланРабот.Заказ.ВремяВыполненияПлан КАК ВремяПлан,
	|	ПланРабот.Трудозатраты КАК ВремяФакт,
	|	ПланРабот.Трудозатраты КАК Трудозатраты,
	|	ВтРабочиеЦентры.НомерПП КАК НомерПП,
	|	ПланРабот.Заказ.РаскройСтрокой КАК РаскройСтрокой,
	|	ПланРабот.Заказ.ТочныйМетражРезки КАК ТочныйМетражРезки,
	|	ПланРабот.Заказ.МатериалНаМашине КАК МатериалНаМашине,
    |	ПланРабот.Заказ.ПодрезкаКромка КАК ПодрезкаКромка,
	|	ПланРабот.Заказ.Номенклатура.Код КАК НоменклатураКод,
	|	ПланРабот.Заказ.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПланРабот.Заказ.Нарезка КАК Нарезка,
	|	ПланРабот.Заказ.ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказаКлиента,
	|	ПланРабот.Заказ.ИсправлениеРоликов КАК ИсправлениеРоликов,
	|	ПланРабот.ВРаботе КАК ВРаботе,
	|	ПланРабот.Заказ.КоличествоУпаковок КАК КоличествоПМ,
	|	ВЫБОР
	|		КОГДА ПланРабот.Заказ.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПланРабот.Заказ.Номенклатура.Наименование
	|		ИНАЧЕ ПланРабот.Заказ.ЗаказКлиента.Партнер.Наименование
	|	КОНЕЦ КАК НоменклатураКлиент,
	|	ПланРабот.Заказ.ЗаказКлиента.Этикетки КАК Этикетки,
	|	ЕСТЬNULL(Лико_РаскройМатериаловПланФактОстатки.КоличествоОстаток, 0) КАК КоличествоОсталось,
	|	ПланРабот.Заказ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтРабочиеЦентры.Сотрудник КАК Сотрудник,
	|	ВтРабочиеЦентры.Период КАК Период
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры КАК РабочиеЦентры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПланРаботБЭ КАК ПланРабот
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_РаскройМатериаловПланФакт.Остатки(
	|						,
	|						Заказ В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								Лико_ПланРаботБЭ.Заказ КАК Заказ
	|							ИЗ
	|								РегистрСведений.Лико_ПланРаботБЭ КАК Лико_ПланРаботБЭ)) КАК Лико_РаскройМатериаловПланФактОстатки
	|				ПО ПланРабот.Заказ = Лико_РаскройМатериаловПланФактОстатки.Заказ
	|			ПО (ПланРабот.РабочийЦентр = РабочиеЦентры.Ссылка)
	|		ПО ВтРабочиеЦентры.РабочийЦентр = РабочиеЦентры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланРабот.Заказ,
	|	РабочиеЦентры.Ссылка,
	|	ПланРабот.Приоритет,
	|	ПланРабот.Заказ.Номер,
	|	РабочиеЦентры.ПорядковыйНомер,
	|	ПланРабот.Осталось,
	|	ПланРабот.ДатаНачала,
	|	ПланРабот.ДатаОкончания,
	|	ПланРабот.Заказ.ВремяВыполненияПлан,
	|	ПланРабот.Трудозатраты,
	|	ВтРабочиеЦентры.НомерПП,
	|	ПланРабот.Заказ.РаскройСтрокой,
	|	ПланРабот.Заказ.ТочныйМетражРезки,
	|	ПланРабот.Заказ.МатериалНаМашине,
	|	ПланРабот.Заказ.ПодрезкаКромка,
	|	ПланРабот.Заказ.Номенклатура.Код,
	|	ПланРабот.Заказ.Нарезка,
	|	ПланРабот.Заказ.ЗаказКлиента.НомерБезПрефикса,
	|	ПланРабот.ВРаботе,
	|	ПланРабот.Заказ.ИсправлениеРоликов,
	|	ПланРабот.Заказ.КоличествоУпаковок,
	|	ПланРабот.Заказ.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА ПланРабот.Заказ.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПланРабот.Заказ.Номенклатура.Наименование
	|		ИНАЧЕ ПланРабот.Заказ.ЗаказКлиента.Партнер.Наименование
	|	КОНЕЦ,
	|	ЕСТЬNULL(Лико_РаскройМатериаловПланФактОстатки.КоличествоОстаток, 0),
	|	ПланРабот.Заказ.ЗаказКлиента.Этикетки,
	|	ПланРабот.Заказ.ЗаказКлиента,
	|	ВтРабочиеЦентры.Сотрудник,
	|	ВтРабочиеЦентры.Период,
	|	ПланРабот.Трудозатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	МАКСИМУМ(ИСТИНА) КАК ВыпускПФ
	|ПОМЕСТИТЬ ВтВыпускПФ
	|ИЗ
	|	Вт КАК Вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|		ПО Вт.ЗаказКлиента = Лико_БланкЭтапа.ЗаказПокупателя
	|ГДЕ
	|	Вт.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.Пустаяссылка)
	|	И Лико_БланкЭтапа.Проведен
	|	И Лико_БланкЭтапа.НомерПроката = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	МАКСИМУМ(ИСТИНА) КАК УшелСПервогоПроката
	|ПОМЕСТИТЬ ВтУшелСПервогоПроката
	|ИЗ
	|	Вт КАК Вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|		ПО Вт.ЗаказКлиента = ПооперационноеРасписание2_2.Этап.Лико_ЗаказКлиента
	|ГДЕ
	|	Вт.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И ПооперационноеРасписание2_2.Выполнено = 1
	|	И НЕ ПооперационноеРасписание2_2.Моделирование
	|	И ПооперационноеРасписание2_2.Этап.НомерПроката = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	ПооперационноеРасписание2_2.Начало КАК НачалоПервогоПроката,
	|	ПооперационноеРасписание2_2.Окончание КАК ОкончаниеПервогоПроката,
	|	Вт.РабочийЦентр КАК РабочийЦентр,
	|	Вт.Приоритет КАК Приоритет,
	|	Вт.Номер КАК Номер,
	|	Вт.Код КАК Код,
	|	Вт.Осталось КАК Осталось,
	|	Вт.ДатаНачала КАК ДатаНачала,
	|	Вт.ДатаОкончания КАК ДатаОкончания,
	|	Вт.ВремяПлан КАК ВремяПлан,
	|	Вт.ВремяФакт КАК ВремяФакт,
	|	Вт.Трудозатраты КАК Трудозатраты,
	|	Вт.НомерПП КАК НомерПП,
	|	Вт.РаскройСтрокой КАК РаскройСтрокой,
	|	Вт.ТочныйМетражРезки КАК ТочныйМетражРезки, 
	|	Вт.МатериалНаМашине КАК МатериалНаМашине,
	|	Вт.ПодрезкаКромка КАК ПодрезкаКромка,
	|	Вт.НоменклатураКод КАК НоменклатураКод,
	|	Вт.НоменклатураНаименование КАК НоменклатураНаименование,
	|	Вт.Нарезка КАК Нарезка,
	|	Вт.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Вт.ИсправлениеРоликов КАК ИсправлениеРоликов,
	|	Вт.ВРаботе КАК ВРаботе,
	|	Вт.КоличествоПМ КАК КоличествоПМ,
	|	Вт.НоменклатураКлиент КАК НоменклатураКлиент,
	|	Вт.Этикетки КАК Этикетки,
	|	Вт.КоличествоОсталось КАК КоличествоОсталось,
	|	Вт.КоличествоПМ - Вт.КоличествоОсталось КАК КоличествоСработано,
	|	Вт.ЗаказКлиента КАК ЗаказКлиента,
	|	ЕСТЬNULL(ВтВыпускПФ.ВыпускПФ, ЛОЖЬ) КАК ВыпускПФ,
	|	ЕСТЬNULL(ВтУшелСПервогоПроката.УшелСПервогоПроката, ЛОЖЬ) КАК УшелСПервогоПроката,
	|	Вт.Сотрудник КАК Сотрудник,
	|	Вт.Период КАК Период
	|ИЗ
	|	Вт КАК Вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВыпускПФ КАК ВтВыпускПФ
	|		ПО Вт.Заказ = ВтВыпускПФ.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУшелСПервогоПроката КАК ВтУшелСПервогоПроката
	|		ПО Вт.Заказ = ВтУшелСПервогоПроката.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|		ПО (Вт.ЗаказКлиента = ПооперационноеРасписание2_2.Этап.Лико_ЗаказКлиента
	|				И НЕ ПооперационноеРасписание2_2.Моделирование
	|				И ПооперационноеРасписание2_2.Этап.НомерПроката = 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПП,
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(Сотрудник),
	|	МАКСИМУМ(Период)
	|ПО
	|	РабочийЦентр";
	// <--  Лико Яцун С. В. 09.03.2023 добавил в запрос связь с ПооперационноеРасписание2_2, чтобы получить НачалоПервогоПроката
	Запрос.УстановитьПараметр("Настройка",Настройка);
	Запрос.УстановитьПараметр("ФильтрПоРЦ",ЗначениеЗаполнено(РабочийЦентр)); 
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр); 
	
	РезультатЗапроса=Запрос.Выполнить();
	
	ВыборкаРабочийцентр = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРабочийцентр.Следующий() Цикл
		Структура = Новый Структура;
		
		Структура.Вставить("УИД",СтрШаблон("ТЗ_%1",Формат(ВыборкаРабочийцентр.Рабочийцентр.ПорядковыйНомер, "ЧГ=")));
		Структура.Вставить("Заголовок",ВыборкаРабочийцентр.Рабочийцентр.Наименование);
		Структура.Вставить("Сотрудник",Строка(ВыборкаРабочийцентр.Сотрудник));
		Структура.Вставить("Период"   ,Формат(ВыборкаРабочийцентр.Период, "ДЛФ=T"));
		
		
		ТЗ = Новый ТаблицаЗначений; 
		ТЗ.Колонки.Добавить("Индикатор"			 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная)));		
		ТЗ.Колонки.Добавить("Приоритет"			 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 1, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("Заказ"				 , Новый ОписаниеТипов("ДокументСсылка.Лико_ЗаказНаРаскрой"));
		ТЗ.Колонки.Добавить("Номер"				 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("ВремяПлан"			 , Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("ВремяФакт"			 , Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой))); 
		ТЗ.Колонки.Добавить("Осталось"			 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("Трудозатраты"		 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
		
		ТЗ.Колонки.Добавить("ДатаНачала"		 , Новый ОписаниеТипов("Дата", , ,	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТЗ.Колонки.Добавить("ДатаОкончания" 	 , Новый ОписаниеТипов("Дата", , ,	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))); 
		
		ТЗ.Колонки.Добавить("РаскройСтрокой" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(140, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("Этикетки" 	 		 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(140, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("ТочныйМетражРезки"  , Новый ОписаниеТипов("Булево"));
		ТЗ.Колонки.Добавить("ПодрезкаКромка" 	 , Новый ОписаниеТипов("Булево"));
		ТЗ.Колонки.Добавить("ИсправлениеРоликов" , Новый ОписаниеТипов("Булево"));
		ТЗ.Колонки.Добавить("ВРаботе" 			 , Новый ОписаниеТипов("Булево")); 
		ТЗ.Колонки.Добавить("ВыпускПФ" 			 , Новый ОписаниеТипов("Булево")); 
		ТЗ.Колонки.Добавить("УшелСПервогоПроката", Новый ОписаниеТипов("Булево")); 
		ТЗ.Колонки.Добавить("МатериалНаМашине", Новый ОписаниеТипов("Булево"));
		
		
		ТЗ.Колонки.Добавить("НоменклатураКод" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("НоменклатураНаименование" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("НоменклатураКлиент" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
		
		
		ТЗ.Колонки.Добавить("Нарезка" 			 , Новый ОписаниеТипов("СправочникСсылка.ЯССМ_Нарезки"));
		ТЗ.Колонки.Добавить("НомерЗаказаКлиента" , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(7, ДопустимаяДлина.Переменная)));
		// <-- Начало Лико Яцун С. В. 28.02.2023 
		ТЗ.Колонки.Добавить("НачалоПервогоПроката"		 , Новый ОписаниеТипов("Дата", , ,	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТЗ.Колонки.Добавить("ОкончаниеПервогоПроката" 	 , Новый ОписаниеТипов("Дата", , ,	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))); 
		// <-- Конец Лико Яцун С. В. 28.02.2023
		ТЗ.Колонки.Добавить("КоличествоПМ"		 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("КоличествоОсталось" , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("КоличествоСработано" , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Любой)));
		
		
		
		
		Выборка	=  ВыборкаРабочийцентр.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			Если ЗначениеЗаполнено(Выборка.Заказ) Тогда
				НоваяСтрокаТз= Тз.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТз,Выборка); 
				НоваяСтрокаТз.ВремяПлан=?(НоваяСтрокаТз.ВремяПлан=0,1,НоваяСтрокаТз.ВремяПлан);
				
				НоваяСтрокаТз.ВремяПлан	= ФорматироватьЧислоКакВремя(НоваяСтрокаТз.ВремяПлан);
				НоваяСтрокаТз.ВремяФакт		= ФорматироватьЧислоКакВремя(НоваяСтрокаТз.ВремяФакт);
				НоваяСтрокаТз.Осталось	= ФорматироватьЧислоКакВремя(НоваяСтрокаТз.Осталось);
				
			КонецЕсли;
		КонецЦикла;
		
		Структура.Вставить("Таблица",ТЗ);
		Структура.Вставить("МассивНастроек",МассивНастроек);
		Массив.Добавить(Структура);		
	КонецЦикла; 
	
	
	Возврат Массив;
КонецФункции  //-Лико m.shenderov 27.12.2021

Функция РендерЭлементовСервер(ЭтаФорма,ТочкаВхода,МассивТЗ,КоличествоТаблицВСтроке) Экспорт //+Лико m.shenderov 27.12.2021  
	 УстановитьПривилегированныйРежим(Истина);

	Элементы= ЭтаФорма.Элементы;
	КоличествоТаблицВСтроке=?(КоличествоТаблицВСтроке=0,1,КоличествоТаблицВСтроке);
	
	МассивИменТз = Новый Массив();
	
	МассивПодчиненныхЭлементов= Новый Массив;
	
	
	Для каждого ЭлементApp Из ТочкаВхода.ПодчиненныеЭлементы Цикл
		МассивПодчиненныхЭлементов.Добавить(ЭлементApp);
	КонецЦикла; 
	Для каждого ЭлМассива Из МассивПодчиненныхЭлементов Цикл
		УдалитьПодчиненыеЭлеметы(Элементы,ЭлМассива);
	КонецЦикла;
	
	
	
	
	КоличествоВГруппе	= 0;
	Группа				= 1;
	КоличествоТЗВсего	= 0;	
	ПерваяГруппаТаблицы = Неопределено;
	
	Для каждого Структура Из МассивТЗ Цикл
		Тз= Структура.Таблица;	
		УИД=Структура.УИД;
		МассивИменТз.Добавить(УИД);
		Если  КоличествоТЗВсего=0 Тогда
			ИмяЭлемента= СтрШаблон("Ряд%1",Группа);
			
			
			Если  Элементы.Найти(ИмяЭлемента)<>Неопределено Тогда
				Элементы.Удалить(Элементы.Найти(ИмяЭлемента));
			КонецЕсли;
			
			
			ТекущаяГруппа						= Элементы.Добавить(СтрШаблон("Ряд%1",Группа),Тип("ГруппаФормы"),ТочкаВхода);
			ТекущаяГруппа.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
			ТекущаяГруппа.Отображение 			= ОтображениеОбычнойГруппы.Нет;
			ТекущаяГруппа.ОтображатьЗаголовок 	= ЛОЖЬ; 
			ТекущаяГруппа.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ПоследняяГруппа						= ТекущаяГруппа;
			
		КонецЕсли;
		
		ИмяЭлемента= СтрШаблон("Группа%1",Уид);
		
		
		Если  Элементы.Найти(ИмяЭлемента)<>Неопределено Тогда
			Элементы.Удалить(Элементы.Найти(ИмяЭлемента));
		КонецЕсли;
		
		
		ГруппаРабочийцентрЭлементы  = Элементы.Добавить(СтрШаблон("Группа%1",Уид),Тип("ГруппаФормы"),ТекущаяГруппа);
		
		Если ПерваяГруппаТаблицы = Неопределено Тогда
			ПерваяГруппаТаблицы  = ГруппаРабочийцентрЭлементы;
		КонецЕсли;
		Последняятаблица                       = ГруппаРабочийцентрЭлементы;
		ГруппаРабочийцентрЭлементы.Вид         = ВидГруппыФормы.ОбычнаяГруппа;   				
		ГруппаРабочийцентрЭлементы.Заголовок   = СтрШаблон("%1.  -->  Сотрудник: %2. Дата начала: %3",Структура.Заголовок,?(ЗначениеЗаполнено(Структура.Сотрудник),Структура.Сотрудник,"Не авторизован!"),Структура.Период);
		ГруппаРабочийцентрЭлементы.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
		КоличествоТЗВсего                   = КоличествоТЗВсего+1;
		Если  КоличествоТЗВсего = КоличествоТаблицВСтроке Тогда
			КоличествоТЗВсего = 0;
			Группа            = Группа+1;
		КонецЕсли; 				
		
		ФормаЭлементыСервер.СоздатьЭлементФормыТаблица(ЭтаФорма,Тз,УИД,ГруппаРабочийцентрЭлементы);
		
		ЭлементТаблица=Элементы[УИД];
		ЭлементТаблица.ТолькоПросмотр=Истина;
		
		Если Структура.Свойство("МассивНастроек") И ТипЗнч(Структура.МассивНастроек)=Тип("Массив") Тогда
			
			
			Для каждого Колонка Из Структура.МассивНастроек Цикл
				
				ИмяКолонки=СтрШаблон("%1%2",УИД,Колонка.Имя); 
				Элементы[ИмяКолонки].Заголовок = Колонка.Заголовок;
				Элементы[ИмяКолонки].Ширина    = Колонка.Ширина;
				Элементы[ИмяКолонки].Формат    = Колонка.Шаблон;
				Элементы[ИмяКолонки].Видимость = Колонка.Видимость;
				
				Элементы.Переместить(Элементы[ИмяКолонки],ЭлементТаблица);				
				
			КонецЦикла;
			
		КонецЕсли;
		
		
		
		
		Элементы[УИД].УстановитьДействие("НачалоПеретаскивания"		, "ТаблицаРЦНачалоПеретаскивания"  );
		Элементы[УИД].УстановитьДействие("ПроверкаПеретаскивания"	, "ТаблицаРЦПроверкаПеретаскивания");
		Элементы[УИД].УстановитьДействие("Перетаскивание"			, "ТаблицаРЦПеретаскивание"        );
		Элементы[УИД].УстановитьДействие("Выбор"					, "ТаблицаВыбор"                   );
		Элементы[УИД].УстановитьДействие("ПриАктивизацииСтроки"		, "ТаблицаПриАктивизацииСтроки"    );
		Элементы[УИД].УстановитьДействие("ПриАктивизацииЯчейки"		, "ТаблицаПриАктивизацииЯчейки"   );				
		
	КонецЦикла;
	
	Если КоличествоТЗВсего<>0 Тогда 
		Тз.Очистить();
		ФормаЭлементыСервер.СоздатьЭлементФормыТаблица(ЭтаФорма,Тз,"Заглушка",ПоследняяГруппа);
		
		Элементы["Заглушка"].Доступность=Ложь; 
		Элементы["Заглушка"].Ширина=(КоличествоТаблицВСтроке-КоличествоТЗВсего)*90;
	КонецЕсли;
	
	Возврат МассивИменТз;	
	
КонецФункции  //-Лико m.shenderov 27.12.2021

Процедура УдалитьПодчиненыеЭлеметы(Элементы,Элемент) //+Лико m.shenderov 13.12.2021
	 УстановитьПривилегированныйРежим(Истина);

	Если  ТипЗнч(Элемент)=Тип("ГруппаФормы") и Элемент.ПодчиненныеЭлементы.Количество()>0 Тогда
		Для каждого ПодЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
			УдалитьПодчиненыеЭлеметы(Элементы,ПодЭлемент);
			//Элементы.Удалить(ПодЭлемент);
		КонецЦикла; 
		
	КонецЕсли;
	Элементы.Удалить(Элемент);
	
	
	
КонецПроцедуры //-Лико m.shenderov 13.12.2021

Функция ФорматироватьЧислоКакВремя(ЧислоВремя) //+Лико m.shenderov 15.06.2022
	
	Часы	= Цел(ЧислоВремя);
	Мин	= (((ЧислоВремя*60))%60)/100;
	Возврат Часы+Мин;  
	
	
КонецФункции  //-Лико m.shenderov 15.06.2022

Функция ЕстьЗаказыВПланеСервер(МассивЗаказов) Экспорт   //+Лико m.shenderov 02.02.2022
 УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланРабот.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.Лико_ПланРаботБЭ КАК ПланРабот
	|ГДЕ
	|	ПланРабот.Заказ В(&МассивЗаказов)";
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Возврат Не Запрос.Выполнить().Пустой();
	
	
КонецФункции //-Лико m.shenderov 02.02.2022 

Функция РЦНайтиПоНомеруСервер(ПорядковыйНомер) Экспорт //+Лико m.shenderov 13.05.2022  
	 УстановитьПривилегированныйРежим(Истина);

	Возврат Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",Число(ПорядковыйНомер));
	
КонецФункции  //-Лико m.shenderov 13.05.2022

Функция ПроверкаИзмененияПланаСервер(МассивСтруктур) Экспорт //+Лико m.shenderov 01.02.2022
	 УстановитьПривилегированныйРежим(Истина);

		
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ПланРабот.Заказ КАК Заказ,
	 |	ПланРабот.РабочийЦентр КАК РЦ,
	 |	ПланРабот.Приоритет КАК Приоритет
	 |ИЗ
	 |	РегистрСведений.Лико_ПланРаботБЭ КАК ПланРабот
	 |ГДЕ
	 |	ПланРабот.РабочийЦентр = &РЦ
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Приоритет";

	Запрос.УстановитьПараметр("РЦ",МассивСтруктур[0].РЦ );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Массив = Новый Массив();
	Пока Выборка.Следующий() Цикл 
		Структура = Новый Структура;
	Структура.Вставить("РЦ","");
	Структура.Вставить("Приоритет",""); 
	Структура.Вставить("Заказ","");

		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		Массив.Добавить(Структура);
	КонецЦикла; 	 
	
	
	Возврат ПолучитьХешОбъекта(МассивСтруктур)<>ПолучитьХешОбъекта(Массив);  
	//Возврат Ложь;
	
КонецФункции //-Лико m.shenderov 01.02.2022 

// Функция - Получить хеш объекта
//
// Параметры:
//  Объект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьХешОбъекта(Объект) Экспорт 
	 УстановитьПривилегированныйРежим(Истина);

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML,Объект);
	ДанныеСтрока=ЗаписьXML.Закрыть();
	
	Хеш=Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеш.Добавить(ДанныеСтрока);
	
	Возврат Хеш.ХешСумма;
КонецФункции 

Процедура СформироватьМассивТЗСерверАсинх(Настройка,WebSocketParam,УИД,Адрес) Экспорт  //+Лико m.shenderov 16.08.2022
	РанжироватьЗаказыПоПриоритету();
	МассивТЗ=СформироватьМассивТЗСервер(Настройка);
	
	Для каждого Структура Из  МассивТЗ Цикл
		Структура.Таблица=ОбщегоНазначения.ТаблицаЗначенийВМассив(Структура.Таблица);
	КонецЦикла;
	
	Контент = Новый Структура;
	Контент.Вставить("Type","UpdatePlan");
	Контент.Вставить("date",ТекущаяДата()); 
	Контент.Вставить("АдресВХ",ПоместитьВоВременноеХранилище(МассивТЗ,Адрес));
	Контент.Вставить("УИД",УИД);
	Контент.Вставить("Сотрудник",Структура.Сотрудник);
	Контент.Вставить("Период",Структура.Период);
	
	
	
	WebSocketСервер.ОтправитьСообщение(WebSocketParam,Контент);
	
	
КонецПроцедуры //-Лико m.shenderov 16.08.2022

////////////////////////////////////////////////////////////////////////////////
//
// Процедура СформироватьОперацию
//
/// Описание: НужноИзменить
//
// Параметры: 
// ИмяСвойства 		   - Строка          	    - (обязательный).  Пример: "Код"    НужноИзменить 
// РабочееМесто 	   - Строка 				- (необязательный).Пример: ПараметрыСеанса.РабочееМестоКлиента  НужноИзменить 
//
Процедура СформироватьОперацию140323(Заказ,РабочийЦентр,Статус,Приоритет=9999,ДатаОперации=Неопределено)Экспорт  //+Лико m.shenderov 16.12.2021
 УстановитьПривилегированныйРежим(Истина);
	
	Если ДатаОперации=Неопределено Тогда		
		ДатаОперации=ТекущаяДата(); 
	КонецЕсли;
	
	ЗаписатьВПлан(Заказ,РабочийЦентр,Статус,Приоритет);
	РанжироватьЗаказыПоПриоритету(,ДатаОперации);
	
	
	
КонецПроцедуры //СформироватьОперацию -Лико m.shenderov 16.12.2021

////////////////////////////////////////////////////////////////////////////////
//
// Процедура РанжироватьЗадачиПоПриоритету
//
/// Описание: НужноИзменить
//
// Параметры: 
// ИмяСвойства 		   - Строка          	    - (обязательный).  Пример: "Код"    НужноИзменить 
// РабочееМесто 	   - Строка 				- (необязательный).Пример: ПараметрыСеанса.РабочееМестоКлиента  НужноИзменить 
//
Процедура РанжироватьЗаказыПоПриоритету140323(МассивРЦ=Неопределено,ДатаОперации=Неопределено) Экспорт  //+Лико m.shenderov 16.12.2021
    УстановитьПривилегированныйРежим(Истина);
	Если  ДатаОперации=Неопределено Тогда 
		ДатаОперации=ТекущаяДата();
	КонецЕсли; 
	
	//СооПК= СооПроизводственныйКалендарь(НачалоДня(ДатаОперации));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПланРаботБЭ.Заказ КАК Заказ,
	|	Лико_ПланРаботБЭ.Заказ.Статус КАК Статус,
	|	Лико_ПланРаботБЭ.Заказ.ВремяВыполненияПлан КАК Осталось,
	|	Лико_ПланРаботБЭ.Заказ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Лико_ПланРаботБЭ.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ПланРаботБЭ.Приоритет КАК Приоритет,
	|	Лико_ПланРаботБЭ.ВРаботе КАК ВРаботе,
	|	Лико_ПланРаботБЭ.ДатаНачала КАК ДатаНачала,
	|	Лико_ПланРаботБЭ.ДатаОкончания КАК ДатаОкончания,
	|	Лико_ПланРаботБЭ.Трудозатраты КАК Трудозатраты,
	|	ЕСТЬNULL(Лико_РаскройМатериаловПланФактОстатки.КоличествоОстаток, 0) КАК КоличествоОсталось,
	|	Лико_ПланРаботБЭ.КоличествоОсталось КАК КоличествоОсталосьСтарое
	|ИЗ
	|	РегистрСведений.Лико_ПланРаботБЭ КАК Лико_ПланРаботБЭ
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_РаскройМатериаловПланФакт.Остатки(
	|				,
	|				Заказ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПланРаботБЭ.Заказ КАК Заказ
	|					ИЗ
	|						РегистрСведений.Лико_ПланРаботБЭ КАК Лико_ПланРаботБЭ)) КАК Лико_РаскройМатериаловПланФактОстатки
	|		ПО Лико_ПланРаботБЭ.Заказ = Лико_РаскройМатериаловПланФактОстатки.Заказ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФильтрПоРЦ
	|				ТОГДА Лико_ПланРаботБЭ.РабочийЦентр В (&МассивРЦ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЦентр,
	|	Приоритет
	|ИТОГИ ПО
	|	РабочийЦентр";
	
	
	
	
	Запрос.УстановитьПараметр("ФильтрПоРЦ",МассивРЦ<>Неопределено);
	
	Запрос.УстановитьПараметр("МассивРЦ",МассивРЦ); 
	Запрос.УстановитьПараметр("ТекущаяДата",НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРЦ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//УстановитьПривилегированныйРежим(Истина);
	Пока ВыборкаРЦ.Следующий()  Цикл
		Сч=1;
		Выборка= ВыборкаРЦ.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ТекТрудозатраты=0;
			Если Сч=1 Тогда  	
				
				ДатаНачала=Выборка.ДатаНачала;
				
				Если Не ЗначениеЗаполнено(ДатаНачала) Или Выборка.Приоритет<>1 Тогда
					
					ДатаНачала = ДатаОперации;
					
				КонецЕсли;
				
				Трудозатраты=(ДатаОперации-ДатаНачала)/(60*60);
				
			Иначе				
				Трудозатраты=0;				
			КонецЕсли;
			Если Выборка.КоличествоОсталось=Выборка.КоличествоОсталосьСтарое Тогда
				
				Осталось=Выборка.Осталось;
			Иначе
				Осталось= Документы.Лико_ЗаказНаРаскрой.РасчитатьВремяВыполнения(Выборка.Заказ,Выборка.КоличествоОсталось).ВремяВыполненияПлан;
			КонецЕсли;
			Осталось=?(Осталось<=0,1,Осталось);
			Осталось=Осталось-Трудозатраты;
			Осталось=?(Осталось<=0,1,Осталось);			
			НаборЗаписей           = РегистрыСведений.Лико_ПланРаботБЭ.СоздатьНаборЗаписей();					
			НаборЗаписей.Отбор.Заказ.Установить(Выборка.Заказ); 
			
			Запись           		= НаборЗаписей.Добавить();
			Запись.Заказ    		= Выборка.Заказ;
			Запись.Осталось  		= Осталось;
			Запись.Трудозатраты		= Трудозатраты;
			Запись.ДатаНачала		= ДатаНачала;
			Запись.Количество		= Выборка.Заказ.КоличествоУпаковок;
			Запись.КоличествоОсталось= Выборка.КоличествоОсталось;
			
			//Запись.ДатаОкончания	= РассчитатьДатуОкончания(?(Сч=1,ДатаОперации,ДатаНачала),Выборка.Сотрудник,Осталось);  
			Запись.ДатаОкончания	= Макс(ДатаОперации,ДатаНачала+Осталось*60*60);
			
			ДатаНачала				= Запись.ДатаОкончания;
			
			Запись.РабочийЦентр =Выборка.РабочийЦентр;
			Запись.Приоритет =Сч;
			
			Если  Сч=1 И Запись.ДатаНачала<=ДатаОперации Тогда
				Запись.ВРаботе = Истина;
				лСтатус         = Перечисления.Лико_СтатусыЗаказовБЭ.ВРаботе;
			Иначе
				Запись.ВРаботе = Ложь;
				лСтатус         = Перечисления.Лико_СтатусыЗаказовБЭ.ВПлане;
			КонецЕсли;
			Если Выборка.Статус<>лСтатус Тогда
				ДокОбъект=Выборка.Заказ.ПолучитьОбъект();
				ДокОбъект.Статус=лСтатус; 
				ДокОбъект.СтатусДата=ДатаОперации;
				НачатьТранзакцию();
				ДокОбъект.ОбменДанными.Загрузка=Истина;
				ДокОбъект.Записать(); 
				НаборЗаписей.Записать();
				ЗафиксироватьТранзакцию();
			Иначе
				НаборЗаписей.Записать();
				
				
			КонецЕсли;
			
			
			Если Запись.ВРаботе<>Выборка.ВРаботе Тогда
				
				//ЗаписатьВЖурналОпераций(Запись.Задача,Запись.Сотрудник,Статус,ДатаОперации);
				
			КонецЕсли;
			
			Сч=Сч+1;
		КонецЦикла; 
	КонецЦикла;
	
	
	
	
КонецПроцедуры //РанжироватьЗадачиПоПриоритету -Лико m.shenderov 16.12.2021

Функция СформироватьМассивТЗСервер140323(Настройка=Неопределено,РабочийЦентр=Неопределено) Экспорт  //+Лико m.shenderov 27.12.2021  
	УстановитьПривилегированныйРежим(Истина);
	
	Если  Не ЗначениеЗаполнено(Настройка) Тогда
		Настройка=Справочники.Лико_НастройкиОтображенияПланаБЭ.Основная;
	КонецЕсли;
	
	
	МассивНастроек=Справочники.Лико_НастройкиОтображенияПланаБЭ.ПолучитьМассивНастроек(Настройка);
	
	Массив = Новый Массив;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеЦентры.РабочийЦентр КАК РабочийЦентр,
	|	РабочиеЦентры.НомерСтроки КАК НомерПП,
	|	Лико_РаботаНаРезакахСрезПоследних.Сотрудник КАК Сотрудник,
	|	Лико_РаботаНаРезакахСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ ВтРабочиеЦентры
	|ИЗ
	|	Справочник.Лико_НастройкиОтображенияПланаБЭ.РабочиеЦентры КАК РабочиеЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_РаботаНаРезаках.СрезПоследних КАК Лико_РаботаНаРезакахСрезПоследних
	|		ПО РабочиеЦентры.РабочийЦентр = Лико_РаботаНаРезакахСрезПоследних.РабочийЦентр
	|ГДЕ
	|	РабочиеЦентры.Ссылка = &Настройка
	|	И ВЫБОР
	|			КОГДА &ФильтрПоРЦ
	|				ТОГДА РабочиеЦентры.РабочийЦентр = &РабочийЦентр
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланРабот.Заказ КАК Заказ,
	|	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	|	ПланРабот.Приоритет КАК Приоритет,
	|	ПланРабот.Заказ.Номер КАК Номер,
	|	РабочиеЦентры.ПорядковыйНомер КАК Код,
	|	ПланРабот.Осталось КАК Осталось,
	|	ПланРабот.ДатаНачала КАК ДатаНачала,
	|	ПланРабот.ДатаОкончания КАК ДатаОкончания,
	|	ПланРабот.Заказ.ВремяВыполненияПлан КАК ВремяПлан,
	|	ПланРабот.Трудозатраты КАК ВремяФакт,
	|	ПланРабот.Трудозатраты КАК Трудозатраты,
	|	ВтРабочиеЦентры.НомерПП КАК НомерПП,
	|	ПланРабот.Заказ.РаскройСтрокой КАК РаскройСтрокой,
	|	ПланРабот.Заказ.ТочныйМетражРезки КАК ТочныйМетражРезки,
	|	ПланРабот.Заказ.ПодрезкаКромка КАК ПодрезкаКромка,
	|	ПланРабот.Заказ.Номенклатура.Код КАК НоменклатураКод,
	|	ПланРабот.Заказ.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПланРабот.Заказ.Нарезка КАК Нарезка,
	|	ПланРабот.Заказ.ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказаКлиента,
	|	ПланРабот.Заказ.ИсправлениеРоликов КАК ИсправлениеРоликов,
	|	ПланРабот.ВРаботе КАК ВРаботе,
	|	ПланРабот.Заказ.КоличествоУпаковок КАК КоличествоПМ,
	|	ВЫБОР
	|		КОГДА ПланРабот.Заказ.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПланРабот.Заказ.Номенклатура.Наименование
	|		ИНАЧЕ ПланРабот.Заказ.ЗаказКлиента.Партнер.Наименование
	|	КОНЕЦ КАК НоменклатураКлиент,
	|	ПланРабот.Заказ.ЗаказКлиента.Этикетки КАК Этикетки,
	|	ЕСТЬNULL(Лико_РаскройМатериаловПланФактОстатки.КоличествоОстаток, 0) КАК КоличествоОсталось,
	|	ПланРабот.Заказ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтРабочиеЦентры.Сотрудник КАК Сотрудник,
	|	ВтРабочиеЦентры.Период КАК Период
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры КАК РабочиеЦентры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПланРаботБЭ КАК ПланРабот
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_РаскройМатериаловПланФакт.Остатки(
	|						,
	|						Заказ В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								Лико_ПланРаботБЭ.Заказ КАК Заказ
	|							ИЗ
	|								РегистрСведений.Лико_ПланРаботБЭ КАК Лико_ПланРаботБЭ)) КАК Лико_РаскройМатериаловПланФактОстатки
	|				ПО ПланРабот.Заказ = Лико_РаскройМатериаловПланФактОстатки.Заказ
	|			ПО (ПланРабот.РабочийЦентр = РабочиеЦентры.Ссылка)
	|		ПО ВтРабочиеЦентры.РабочийЦентр = РабочиеЦентры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланРабот.Заказ,
	|	РабочиеЦентры.Ссылка,
	|	ПланРабот.Приоритет,
	|	ПланРабот.Заказ.Номер,
	|	РабочиеЦентры.ПорядковыйНомер,
	|	ПланРабот.Осталось,
	|	ПланРабот.ДатаНачала,
	|	ПланРабот.ДатаОкончания,
	|	ПланРабот.Заказ.ВремяВыполненияПлан,
	|	ПланРабот.Трудозатраты,
	|	ВтРабочиеЦентры.НомерПП,
	|	ПланРабот.Заказ.РаскройСтрокой,
	|	ПланРабот.Заказ.ТочныйМетражРезки,
	|	ПланРабот.Заказ.ПодрезкаКромка,
	|	ПланРабот.Заказ.Номенклатура.Код,
	|	ПланРабот.Заказ.Нарезка,
	|	ПланРабот.Заказ.ЗаказКлиента.НомерБезПрефикса,
	|	ПланРабот.ВРаботе,
	|	ПланРабот.Заказ.ИсправлениеРоликов,
	|	ПланРабот.Заказ.КоличествоУпаковок,
	|	ПланРабот.Заказ.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА ПланРабот.Заказ.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПланРабот.Заказ.Номенклатура.Наименование
	|		ИНАЧЕ ПланРабот.Заказ.ЗаказКлиента.Партнер.Наименование
	|	КОНЕЦ,
	|	ЕСТЬNULL(Лико_РаскройМатериаловПланФактОстатки.КоличествоОстаток, 0),
	|	ПланРабот.Заказ.ЗаказКлиента.Этикетки,
	|	ПланРабот.Заказ.ЗаказКлиента,
	|	ВтРабочиеЦентры.Сотрудник,
	|	ВтРабочиеЦентры.Период,
	|	ПланРабот.Трудозатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	МАКСИМУМ(ИСТИНА) КАК ВыпускПФ
	|ПОМЕСТИТЬ ВтВыпускПФ
	|ИЗ
	|	Вт КАК Вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|		ПО Вт.ЗаказКлиента = Лико_БланкЭтапа.ЗаказПокупателя
	|ГДЕ
	|	Вт.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.Пустаяссылка)
	|	И Лико_БланкЭтапа.Проведен
	|	И Лико_БланкЭтапа.НомерПроката = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	МАКСИМУМ(ИСТИНА) КАК УшелСПервогоПроката
	|ПОМЕСТИТЬ ВтУшелСПервогоПроката
	|ИЗ
	|	Вт КАК Вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|		ПО Вт.ЗаказКлиента = ПооперационноеРасписание2_2.Этап.Лико_ЗаказКлиента
	|ГДЕ
	|	Вт.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И ПооперационноеРасписание2_2.Выполнено = 1
	|	И НЕ ПооперационноеРасписание2_2.Моделирование
	|	И ПооперационноеРасписание2_2.Этап.НомерПроката = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	Вт.РабочийЦентр КАК РабочийЦентр,
	|	Вт.Приоритет КАК Приоритет,
	|	Вт.Номер КАК Номер,
	|	Вт.Код КАК Код,
	|	Вт.Осталось КАК Осталось,
	|	Вт.ДатаНачала КАК ДатаНачала,
	|	Вт.ДатаОкончания КАК ДатаОкончания,
	|	Вт.ВремяПлан КАК ВремяПлан,
	|	Вт.ВремяФакт КАК ВремяФакт,
	|	Вт.Трудозатраты КАК Трудозатраты,
	|	Вт.НомерПП КАК НомерПП,
	|	Вт.РаскройСтрокой КАК РаскройСтрокой,
	|	Вт.ТочныйМетражРезки КАК ТочныйМетражРезки,
	|	Вт.ПодрезкаКромка КАК ПодрезкаКромка,
	|	Вт.НоменклатураКод КАК НоменклатураКод,
	|	Вт.НоменклатураНаименование КАК НоменклатураНаименование,
	|	Вт.Нарезка КАК Нарезка,
	|	Вт.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Вт.ИсправлениеРоликов КАК ИсправлениеРоликов,
	|	Вт.ВРаботе КАК ВРаботе,
	|	Вт.КоличествоПМ КАК КоличествоПМ,
	|	Вт.НоменклатураКлиент КАК НоменклатураКлиент,
	|	Вт.Этикетки КАК Этикетки,
	|	Вт.КоличествоОсталось КАК КоличествоОсталось,
	|	Вт.КоличествоПМ - Вт.КоличествоОсталось КАК КоличествоСработано,
	|	Вт.ЗаказКлиента КАК ЗаказКлиента,
	|	ЕСТЬNULL(ВтВыпускПФ.ВыпускПФ, ЛОЖЬ) КАК ВыпускПФ,
	|	ЕСТЬNULL(ВтУшелСПервогоПроката.УшелСПервогоПроката, ЛОЖЬ) КАК УшелСПервогоПроката,
	|	Вт.Сотрудник КАК Сотрудник,
	|	Вт.Период КАК Период
	|ИЗ
	|	Вт КАК Вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВыпускПФ КАК ВтВыпускПФ
	|		ПО Вт.Заказ = ВтВыпускПФ.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУшелСПервогоПроката КАК ВтУшелСПервогоПроката
	|		ПО Вт.Заказ = ВтУшелСПервогоПроката.Заказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПП,
	|	Приоритет
	|ИТОГИ
	|	МАКСИМУМ(Сотрудник),
	|	МАКСИМУМ(Период)
	|ПО
	|	РабочийЦентр";
	
	Запрос.УстановитьПараметр("Настройка",Настройка);
	Запрос.УстановитьПараметр("ФильтрПоРЦ",ЗначениеЗаполнено(РабочийЦентр)); 
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр); 
	
	РезультатЗапроса=Запрос.Выполнить();
	
	ВыборкаРабочийцентр = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРабочийцентр.Следующий() Цикл
		Структура = Новый Структура;
		
		Структура.Вставить("УИД",СтрШаблон("ТЗ_%1",Формат(ВыборкаРабочийцентр.Рабочийцентр.ПорядковыйНомер, "ЧГ=")));
		Структура.Вставить("Заголовок",ВыборкаРабочийцентр.Рабочийцентр.Наименование);
		Структура.Вставить("Сотрудник",Строка(ВыборкаРабочийцентр.Сотрудник));
		Структура.Вставить("Период"   ,Формат(ВыборкаРабочийцентр.Период, "ДЛФ=T"));
		
		
		ТЗ = Новый ТаблицаЗначений; 
		ТЗ.Колонки.Добавить("Индикатор"			 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная)));		
		ТЗ.Колонки.Добавить("Приоритет"			 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 1, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("Заказ"				 , Новый ОписаниеТипов("ДокументСсылка.Лико_ЗаказНаРаскрой"));
		ТЗ.Колонки.Добавить("Номер"				 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("ВремяПлан"			 , Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("ВремяФакт"			 , Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой))); 
		ТЗ.Колонки.Добавить("Осталось"			 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("Трудозатраты"		 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
		
		ТЗ.Колонки.Добавить("ДатаНачала"		 , Новый ОписаниеТипов("Дата", , ,	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТЗ.Колонки.Добавить("ДатаОкончания" 	 , Новый ОписаниеТипов("Дата", , ,	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))); 
		
		ТЗ.Колонки.Добавить("РаскройСтрокой" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(140, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("Этикетки" 	 		 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(140, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("ТочныйМетражРезки"  , Новый ОписаниеТипов("Булево"));
		ТЗ.Колонки.Добавить("ПодрезкаКромка" 	 , Новый ОписаниеТипов("Булево"));
		ТЗ.Колонки.Добавить("ИсправлениеРоликов" , Новый ОписаниеТипов("Булево"));
		ТЗ.Колонки.Добавить("ВРаботе" 			 , Новый ОписаниеТипов("Булево")); 
		ТЗ.Колонки.Добавить("ВыпускПФ" 			 , Новый ОписаниеТипов("Булево")); 
		ТЗ.Колонки.Добавить("УшелСПервогоПроката", Новый ОписаниеТипов("Булево"));
		
		
		ТЗ.Колонки.Добавить("НоменклатураКод" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("НоменклатураНаименование" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("НоменклатураКлиент" 	 , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
		
		
		ТЗ.Колонки.Добавить("Нарезка" 			 , Новый ОписаниеТипов("СправочникСсылка.ЯССМ_Нарезки"));
		ТЗ.Колонки.Добавить("НомерЗаказаКлиента" , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(7, ДопустимаяДлина.Переменная)));
		ТЗ.Колонки.Добавить("КоличествоПМ"		 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("КоличествоОсталось" , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("КоличествоСработано" , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Любой)));
		
		
		
		
		Выборка	=  ВыборкаРабочийцентр.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			Если ЗначениеЗаполнено(Выборка.Заказ) Тогда
				НоваяСтрокаТз= Тз.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТз,Выборка); 
				НоваяСтрокаТз.ВремяПлан=?(НоваяСтрокаТз.ВремяПлан=0,1,НоваяСтрокаТз.ВремяПлан);
				
				НоваяСтрокаТз.ВремяПлан	= ФорматироватьЧислоКакВремя(НоваяСтрокаТз.ВремяПлан);
				НоваяСтрокаТз.ВремяФакт		= ФорматироватьЧислоКакВремя(НоваяСтрокаТз.ВремяФакт);
				НоваяСтрокаТз.Осталось	= ФорматироватьЧислоКакВремя(НоваяСтрокаТз.Осталось);
				
			КонецЕсли;
		КонецЦикла;
		
		Структура.Вставить("Таблица",ТЗ);
		Структура.Вставить("МассивНастроек",МассивНастроек);
		Массив.Добавить(Структура);		
	КонецЦикла; 
	
	
	Возврат Массив;
КонецФункции  //-Лико m.shenderov 27.12.2021
